"use strict";

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface, Sequelize) {
    await queryInterface.bulkInsert(
      "Articles",
      [
        {
          title: "فن الفسيفساء في الأردن",
          content: `الفن الفسيفسائي هو أحد أقدم الفنون التي عرفتها البشرية. يتمثل هذا الفن في تجميع قطع صغيرة من الحجارة أو الزجاج أو السيراميك لتشكيل صور فنية رائعة. في الأردن، يمتد تاريخ الفسيفساء إلى العصور القديمة حيث يمكن العثور على العديد من الأمثلة الجميلة في المواقع الأثرية مثل مادبا والبحر الميت. تعتمد تقنيات الفسيفساء على الدقة والصبر، حيث يجب على الفنان ترتيب كل قطعة صغيرة بعناية لتحقيق التصميم النهائي. نستخدم الأدوات اليدوية البسيطة مثل الملاقط والمطارق الصغيرة، وأحيانًا يتم رسم التصميم المبدئي على السطح قبل بدء وضع القطع. الفسيفساء ليست فقط فناً جميلاً ولكنها تحمل أيضًا تاريخًا وثقافة، حيث تعكس التصاميم والأنماط المستخدمة في الفسيفساء الأردنية التراث الثقافي والديني للمنطقة.`,
          breif:
            "اكتشف فن صناعة الفسيفساء المعقد. صمم واصنع قطعتك الخاصة باستخدام تقنيات مستوحاة من الفسيفساء الأردنية القديمة.",
          author_id: 1, // Assuming user with id 1 is the author
          is_approved: true,
          createdAt: new Date(),
          updatedAt: new Date(),
          image: "mosaic-postcard-c-beck-1-1.jpg",
        },
        {
          title: "المأكولات الشعبية الأردنية",
          content: `المأكولات الشعبية الأردنية تعتبر من أشهر المأكولات في المنطقة. تتميز هذه المأكولات بمذاقها الفريد والمكونات الطبيعية التي تستخدم في إعدادها. تشتهر الأردن بالعديد من الأطباق الشهية مثل المنسف والمنقوشة والمناقيش. تعتبر المأكولات الأردنية غنية بالنكهات والتوابل، حيث تستخدم العديد من الأعشاب والتوابل الطبيعية في إعداد الطعام. تعكس المأكولات الشعبية الأردنية تنوع الثقافة الغذائية في المنطقة، حيث تجمع بين العناصر الغذائية الأساسية مثل اللحوم والخضروات والحبوب بطريقة فريدة ولذيذة.`,
          breif:
            "استمتع بتذوق المأكولات الشعبية الأردنية الشهية. اكتشف النكهات الفريدة والمكونات الطبيعية التي تميز المأكولات الأردنية.",
          author_id: 2, // Assuming user with id 2 is the author
          is_approved: true,
          createdAt: new Date(),
          updatedAt: new Date(),
          image: "المأكولات_الشعبية_الاردنية.jpg",
        },
        {
          title: "مكمورة الدجاج الأردنية",
          content:
            "سميت هذه الأكلة بالمكمروة لأن العجين يستعمل لكمر، أي تغطية الدجاج أو اللحم والبصل على شكل طبقات لتكوين فطيرة تُضَع بالفرن. عُرفت المكمورة في أرياف شمال الأردن وتصنع عادة في فصل الشتاء. تحتوي على كمية كبيرة من زيت الزيتون الذي يدهن على العجين بين كل طبقة مما يعطي طبقات العجين في داخل الفطيرة ملمس طري ويساعد على تحمير العجين في الطبقات الخارجية.",
          breif:
            "استمتع بتذوق المكمورة الشهية للدجاج الأردنية. اكتشف النكهات الفريدة والمكونات الطبيعية التي تميز المكمورة الأردنية.",
          author_id: 3, // Assuming user with id 3 is the author
          is_approved: true,
          createdAt: new Date(),
          updatedAt: new Date(),
          image: "مكمورة-الدجاج-الأردنية.jpg",
        },
        {
          title: "الكعاكيل",
          content:
            "الكعاكيل أو التشعاتيل هي أكلة أردنية عريقة تحمل بين طياتها عبق التراث وقيمته الغذائية العالية. تُعد هذه الوجبة من الأكلات الشعبية في بعض المناطق الأردنية، وتتميز بنكهة تقليدية فريدة تجذب الجميع. تعتمد طريقة التحضير على صنع عجينة بسيطة تتكون من الدقيق والماء والملح، تُشكل بعد ذلك على شكل كرات صغيرة أو لفائف. تُطهى الكعاكيل في مرق غني بنكهة اللحم أو الدجاج، مع إضافة بعض التوابل التي تعزز النكهة، وتُقدم إلى جانب البصل أو اللبن أو الأرز. يُعد إعداد هذه الأكلة رمزًا للترابط العائلي؛ إذ يحرص العديد من الناس على تحضيرها في التجمعات العائلية والمناسبات الخاصة. تتناقل وصفة الكعاكيل عبر الأجيال، لتبقى شاهدةً على تقاليد الطهي القديمة والأصيلة في الأردن.",
          breif:
            "الكعاكيل أو التشعاتيل هي أكلة أردنية تراثية تتكون من عجينة تُشكل على هيئة كرات صغيرة أو لفائف وتُطهى في مرق مع اللحم أو الدجاج، وتقدم عادةً مع اللبن أو الأرز. تشتهر بطعمها اللذيذ وتعد وجبة متكاملة تُحضر في المناسبات والأعياد.",
          author_id: 1,
          is_approved: true,
          createdAt: new Date(),
          updatedAt: new Date(),
          image: "الكعاكيل.jfif",
        },
      ],
      {}
    );
  },

  async down(queryInterface, Sequelize) {
    await queryInterface.bulkDelete("Articles", null, {});
  },
};
